#+PROPERTY: var topdir="/Users/drumbeat/Contracts/METVC/TVCLLC/NICEFSRS2/whoi_r2r_847822" entity="whoi" program="r2r" projroot="847822" subpoints="00 01 02" period="ifas"
** test shell variable passing
In the following script we test variable passing. This section can go away eventually.
#+NAME: test_shell_variable_passing
#+BEGIN_SRC sh :results verbatim :var period="ifas" fsrurlprefix="http://fsr2.whoi.edu/servlet/fsrreport/ifas/2/grp/JL/" httpuser="arm" httppass="Wh135=justfine" downloadresults="~/Downloads"

ddir=$topdir/downloads
datestring=`date "+%Y%m%d"`

for i in $subpoints
do
projnum=$projroot$i
echo $projnum
done

#+END_SRC

#+RESULTS: test_shell_variable_passing
: 84782200
: 84782201
: 84782202

* dwn: download WHOI project FSR (fsr) and transaction detail (itd) detail
FSR reports display the state of an account at various points in time.
In this code block we gather various formats for both the summary FSR report and
the detailed transactions.
#+NAME: dwn_fsritd
#+BEGIN_SRC sh :results verbatim :var httpuser="arm" httppass="Wh135-justfine" 

#Go to the datadirectory
cd $topdir

# Initialize variables
wgetprefix="wget --http-user=$httpuser --http-password=$httppass"
datestring=`date "+%Y%m%d"`

for i in $subpoints
do
projnum=$projroot$i

# Downloads

#FSR summary in PDF and CSV
$wgetprefix http://fsr2.whoi.edu/servlet/fsrmakepdf/$period/2/grp/JL/$projnum.pdf?method=report -O ./downloads/pdf/$projnum\_fsr_dwn_$period\-$datestring.pdf
sleep 5
$wgetprefix http://fsr2.whoi.edu/servlet/fsrreport/$period/2/grp/JL/$projnum.csv -O ./downloads/$projnum\_fsr_dwn_$period\-$datestring.csv
sleep 5

# FSR ITD detail in PDF and CSV
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$period/2/grp/JL/$projnum.pdf?col=itd -O ./downloads/pdf/$projnum\_itd_dwn_$period\-$datestring.pdf
sleep 5
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$period/2/grp/JL/$projnum.csv?col=itd -O ./downloads/$projnum\_itd_dwn_$period\-$datestring.csv
sleep 5

echo "downloaded $projnum FSR summary and ITD files for period $period on date $datestring"

done

#+END_SRC

#+RESULTS: dwn_fsritd
: downloaded 84782200 FSR summary and ITD files for period ifas on date 20140211
: downloaded 84782201 FSR summary and ITD files for period ifas on date 20140211
: downloaded 84782202 FSR summary and ITD files for period ifas on date 20140211

* dwn: download WHOI people hours (phr) detail
Information on hours charged to a project is posted monthly. There is no singly report
that provides all the monthly hours charged to a project. Therefore in the code
block below we gather the reports for every month. This script can be optimized
to only gather months up until the current month at some point.
#+NAME: dwn_phr
#+BEGIN_SRC sh :results verbatim :var httpuser="arm" httppass="Wh135-justfine" year=2014

#Go to the datadirectory
cd $topdir

# Initialize variables
wgetprefix="wget --http-user=$httpuser --http-password=$httppass"
datestring=`date "+%Y%m%d"`

for i in $subpoints
do
projnum=$projroot$i

#FSR PHR detail in CSV
#for i in 01 02 03 04 05 06 07 08 09 10 11 12
for i in 01 02
do
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$year$i/2/grp/JL/$projnum.pdf?col=ppi -O ./downloads/pdf/$projnum\_phr_dwn_$year$i\-$datestring.pdf
sleep 5
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$year$i/2/grp/JL/$projnum.csv?col=ppi -O ./downloads/$projnum\_phr_dwn_$year$i\-$datestring.csv
sleep 5
done

echo "downloaded $projnum PHR info on date $datestring"

done
#+END_SRC

#+RESULTS: dwn_phr
: downloaded 84782200 PPI info on date 20140211
: downloaded 84782201 PPI info on date 20140211
: downloaded 84782202 PPI info on date 20140211

* dwn: download WHOI funds allocated (gpg) and encumberance (enc) detail
This code block downloads budget and encumberance details for the project. We use "ifas" as the
period but it appears that any period returns the same results -- an ITD list
of budget entries from the start of the project.
#+NAME: dwn_gpgen
#+BEGIN_SRC sh :results verbatim :var httpuser="arm" httppass="Wh135-justfine"
#Go to the datadirectory
cd $topdir

# Initialize variables
wgetprefix="wget --http-user=$httpuser --http-password=$httppass"
datestring=`date "+%Y%m%d"`

for i in $subpoints
do
projnum=$projroot$i

# Budget details
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$period/2/grp/JL/$projnum.pdf?col=gbg -O ./downloads/pdf/$projnum\_gpg_dwn_$period\-$datestring.pdf
sleep 5
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$period/2/grp/JL/$projnum.csv?col=gbg -O ./downloads/$projnum\_gpg_dwn_$period\-$datestring.csv
sleep 5

# Encumberance details
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$period/2/grp/JL/$projnum.pdf?col=en -O ./downloads/pdf/$projnum\_enc_dwn_$period\-$datestring.pdf
$wgetprefix http://fsr2.whoi.edu/servlet/fsrdetail/$period/2/grp/JL/$projnum.csv?col=en -O ./downloads/$projnum\_enc_dwn_$period\-$datestring.csv

echo "downloaded $projnum Budget and Encumberance info on date $datestring"

done

#+END_SRC

#+RESULTS: dwn_gpgen
: downloaded 84782200 Budget and Encumberance info on date 20140211
: downloaded 84782201 Budget and Encumberance info on date 20140211
: downloaded 84782202 Budget and Encumberance info on date 20140211

* raw: transform specified downloaded data (from dwn phase) to data directory files (raw)
Here we update all the raw files in the data directory with fresh versions.
#+NAME: dwn2raw
#+BEGIN_SRC sh :results verbatim :var datestring=20140211

# IMPORTANT!!!!!!!!!! --> SET DATESTRING BEFORE EXECUTING THIS!!!!!!!

# Need to make sure that data for today has been downloaded since this script
# picks up data collected on todays date

# Go to the datadirectory
cd $topdir

for i in $subpoints
do
projnum=$projroot$i

# copy fsr summary and detail files up one level
cp ./downloads/$projnum\_fsr\_dwn_$period\-$datestring.csv ./data/$projnum\_fsr_raw.csv
cp ./downloads/$projnum\_itd\_dwn_$period\-$datestring.csv ./data/$projnum\_itd_raw.csv
cp ./downloads/$projnum\_enc\_dwn_$period\-$datestring.csv ./data/$projnum\_enc_raw.csv
cp ./downloads/$projnum\_gpg\_dwn_$period\-$datestring.csv ./data/$projnum\_gpg_raw.csv

# concatenate all the phr files we have into one phr file
# TODO - Need to improve this algorithm so duplicate file not copied for phr file
cat ./downloads/$projnum\_phr_dwn_201[34][0-1][0-9]-*.csv > ./data/$projnum\_phr_raw.csv

echo "copied $projnum data from period $period downloaded files to data dir date $datestring"

done

#+END_SRC

#+RESULTS: dwn2raw
: copied 84782200 data from period ifas downloaded files to data dir date 20140211
: copied 84782201 data from period ifas downloaded files to data dir date 20140211
: copied 84782202 data from period ifas downloaded files to data dir date 20140211

* cln: copy the raw (raw) data files into clean (cln) data files
For the time being we basically copy the raw files to cooked files.
In the future each of the raw files, downloaded from the accounting system
will be transformed into a CSV capable of being imported into the ledger
software, attaching a UUID to each transaction as it is created. The
difficutly at present is that multiple virtual accounts have to be assigned
to each transaction. gawk is a better tool for this currently.

#+NAME: raw2cln
#+BEGIN_SRC sh :results verbatim

# Go to the datadirectory
cd $topdir

for i in $subpoints
do
projnum=$projroot$i

# for now just copy raw files to processed (cln) files
cp ./data/$projnum\_fsr_raw.csv ./data/$projnum\_fsr_cln.csv
cp ./data/$projnum\_itd_raw.csv ./data/$projnum\_itd_cln.csv
cp ./data/$projnum\_phr_raw.csv ./data/$projnum\_phr_cln.csv
cp ./data/$projnum\_enc_raw.csv ./data/$projnum\_enc_cln.csv
cp ./data/$projnum\_gpg_raw.csv ./data/$projnum\_gpg_cln.csv

date; echo "raw2cln performed for $projnum"

done

#+END_SRC

#+RESULTS: raw2cln
: Tue Feb 11 17:56:20 EST 2014
: raw2cln performed for 84782200
: Tue Feb 11 17:56:20 EST 2014
: raw2cln performed for 84782201
: Tue Feb 11 17:56:20 EST 2014
: raw2cln performed for 84782202

* gawk cooked data files into ledger-compatible transactions
In this step we create ledger-compatible journal files from the cooked
data files and place them in the journals subdirectory. A series of project-specific
gawk scripts, sitting in the scripts directory, are used for this purpose. At some
point we may want to have a global gawk script that calls a local gawk script at
the end of it.
- be sure to look at https://github.com/quentinsf/icsv2ledger for more ideas about how to convert csvs to the journal files we wish to create. Perhaps extend it to use virtual accounts
- this too - https://github.com/cantino/reckon
- and this - https://github.com/bhutley/bank-csv-to-ledger
- and wiegley's -- https://github.com/jwiegley/CSV2Ledger
- that was copied from here -- http://bazaar.launchpad.net/~rladams/csv2ledger/main/files


#+NAME: cln2jnl
#+BEGIN_SRC sh :results verbatim
# Go to the datadirectory
cd $topdir
date
for i in $subpoints
do
projnum=$projroot$i

# ITD file into ledger file and sort journal
gawk -f ./scripts/$projroot\_itd_cln2jnl.awk ./data/$projnum\_itd_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_itd_jnl.journal

# PHR file into ledger file and sort journal
gawk --file=./scripts/$projroot\_phr_cln2jnl.awk ./data/$projnum\_phr_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_phr_jnl.journal

# GPG file into ledger file and sort journal
gawk --file=./scripts/$projroot\_gpg_cln2jnl.awk ./data/$projnum\_gpg_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_gpg_jnl.journal

# GPG file into ledger file and sort journal
gawk --file=./scripts/$projroot\_enc_cln2jnl.awk ./data/$projnum\_enc_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_enc_jnl.journal
gawk --file=./scripts/$projroot\_enc_cln2jnl.awk ./data/$projnum\_enc_cln.csv | ledger print --file - --sort d 


# Combine all 3 into a single (i)nception-to-date + (p)eople + (b)udger transaction file
cat ./journals/$projnum\_{itd,gpg,phr}_jnl.journal > ./journals/$projnum\_ipb_jnl.journal

echo "ledger files created for $projnum"

done

# Create projroot ledger files and sort 
cat ./journals/$projroot[0-9][0-9]_itd_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_itd_jnl.journal
cat ./journals/$projroot[0-9][0-9]_phr_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_phr_jnl.journal
cat ./journals/$projroot[0-9][0-9]_gpg_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_gpg_jnl.journal
cat ./journals/$projroot[0-9][0-9]_ipb_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_ipb_jnl.journal
echo "concatenated ledger files"

# Create new accounts file listing all accounts used
ledger --file ./journals/$projroot\_itd_jnl.journal accounts | sed -e "s/^/account /" | sort > ./journals/$projroot\_acc_jnl.journal
#+END_SRC

#+RESULTS: cln2jnl
: Tue Feb 11 18:09:27 EST 2014
: ledger files created for 84782200
: ledger files created for 84782201
: ledger files created for 84782202
: concatenated ledger files

#+NAME: cln2jnl2
#+BEGIN_SRC sh :results verbatim
# Go to the datadirectory
cd $topdir
date
for i in $subpoints
do
projnum=$projroot$i

# ITD file into ledger file and sort journal
#gawk -f ./scripts/$projroot\_itd_cln2jnl.awk ./data/$projnum\_itd_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_itd_jnl.journal

# PHR file into ledger file and sort journal
#gawk --file=./scripts/$projroot\_phr_cln2jnl.awk ./data/$projnum\_phr_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_phr_jnl.journal

# GPG file into ledger file and sort journal
#gawk --file=./scripts/$projroot\_gpg_cln2jnl.awk ./data/$projnum\_gpg_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_gpg_jnl.journal

# GPG file into ledger file and sort journal
#gawk --file=./scripts/$projroot\_enc_cln2jnl.awk ./data/$projnum\_enc_cln.csv | ledger print --file - --sort d > ./journals/$projnum\_enc_jnl.journal
gawk --file=./scripts/$projroot\_enc_cln2jnl.awk ./data/$projnum\_enc_cln.csv | ledger print --file - --sort d 


# Combine all 3 into a single (i)nception-to-date + (p)eople + (b)udger transaction file
cat ./journals/$projnum\_{itd,gpg,phr}_jnl.journal > ./journals/$projnum\_ipb_jnl.journal

echo "ledger files created for $projnum"

done

# Create projroot ledger files and sort 
cat ./journals/$projroot[0-9][0-9]_itd_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_itd_jnl.journal
cat ./journals/$projroot[0-9][0-9]_phr_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_phr_jnl.journal
cat ./journals/$projroot[0-9][0-9]_gpg_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_gpg_jnl.journal
cat ./journals/$projroot[0-9][0-9]_ipb_jnl.journal | ledger print --file - --sort d > ./journals/$projroot\_ipb_jnl.journal
echo "concatenated ledger files"

# Create new accounts file listing all accounts used
ledger --file ./journals/$projroot\_itd_jnl.journal accounts | sed -e "s/^/account /" | sort > ./journals/$projroot\_acc_jnl.journal
#+END_SRC

* -->csv: cleanup the raw (raw) data files into clean proper CSV (csv) files
For the time being we take the raw downloaded file and transform it
into a csv file that is properly formatted for ingestion using the "ledger import"
command

#+NAME: raw2cln2
#+BEGIN_SRC sh :results verbatim

# Go to the datadirectory
cd $topdir

for i in $subpoints
do
projnum=$projroot$i

# create clean (cln) files compatible with ledger convert
gawk -f ./scripts/$projroot\_itd_raw2cln.awk ./data/$projnum\_itd_raw.csv > ./data/$projnum\_itd_csv.csv

date; echo "raw2cln2 performed for $projnum"

done

#+END_SRC

#+RESULTS: raw2cln2
: Tue Feb 11 17:21:39 EST 2014
: raw2cln2 performed for 84782200
: Tue Feb 11 17:21:39 EST 2014
: raw2cln2 performed for 84782201
: Tue Feb 11 17:21:39 EST 2014
: raw2cln2 performed for 84782202
** Add the metadata
#+NAME: add_metad_columns
#+BEGIN_SRC sh :results verbatim
# Go to the datadirectory
cd $topdir
date
for i in $subpoints
do
projnum=$projroot$i

# ITD file into ledger file and sort journal
./scripts/add_metad_columns.pl -i ./data/84782200_itd_cln.csv -o ./data/84782200_itd_mda.csv -m ./config/WHOI_AndyView_default_matches.csv
# cat  ./data/$projnum\_itd_mda.csv

echo "metadata added for $projnum csvs"

done
#+END_SRC

#+RESULTS: add_metad_columns
: Thu Feb  6 13:53:59 EST 2014
: metadata added for 84782200 csvs
: metadata added for 84782201 csvs
: metadata added for 84782202 csvs

** do the work
#+NAME: mda2jou
#+BEGIN_SRC sh :results verbatim
# Go to the datadirectory
cd $topdir
date
for i in $subpoints
do
projnum=$projroot$i

# ITD file into ledger file and sort journal
./scripts/CSV2ledger.pl -i ./data/$projnum\_itd_mda.csv -o ./data/$projnum\_itd_c2l.journal -d "Date" -t "TRXDesc" -a "Amount" -f ./config/FileMatches.yaml -p ./config/PreProcess.yaml -m AccountMatches.yaml

echo "ledger files created for $projnum"

done

#+END_SRC

#+RESULTS: mda2jou
: Thu Feb  6 15:52:13 EST 2014
: ledger files created for 84782200
: ledger files created for 84782201
: ledger files created for 84782202

* report balance of funds on project
#+NAME rep_AndyView
#+BEGIN_SRC sh :results verbatim :var depth=3

for i in $subpoints
do
projnum=$projroot$i
echo
echo "AndyView Balance for Project $projnum"
ledger --file $topdir/journals/$projnum\_itd_jnl.journal bal --depth $depth AndyView:Expenses
done
echo
#+END_SRC

#+RESULTS:
#+begin_example

AndyView Balance for Project 84782200
          $717584.12  AndyView:Expenses
           $76967.50    ConsultingServices
            $2996.90    Other
          $593017.35    Salary
           $25265.83    Supplies
           $19336.54    Travel
--------------------
          $717584.12

AndyView Balance for Project 84782201
           $66389.85  AndyView:Expenses
           $16200.00    ConsultingServices
             $432.51    Other
           $47282.87    Salary
            $1022.38    Supplies
            $1452.09    Travel
--------------------
           $66389.85

AndyView Balance for Project 84782202
           $14868.03  AndyView:Expenses
           $11519.64    Salary
            $3348.39    Travel
--------------------
           $14868.03

#+end_example

